import logging
from contextlib import asynccontextmanager
from fastapi import FastAPI
from src.config import settings

ASCII_ART = r"""                                                                  
 ▄▄▄▄▄▄▄                               ▄▄    ▄▄▄▄▄▄▄   ▄▄▄▄▄   ▄▄▄      
█████▀▀▀                               ██   █████▀▀▀ ▄███████▄ ███      
 ▀████▄   ▀▀█▄ ███▄███▄ ██ ██  ▀▀█▄ ▄████    ▀████▄  ███   ███ ███      
   ▀████ ▄█▀██ ██ ██ ██ ██▄██ ▄█▀██ ██ ██      ▀████ ███▄█▄███ ███      
███████▀ ▀█▄██ ██ ██ ██  ▀█▀  ▀█▄██ ▀████   ███████▀  ▀█████▀  ████████ 
                                                           ▀▀                                                                
            ▄▄  ▄▄▄▄   ▄▄▄▄  ▄▄ ▄▄ ▄▄  ▄▄ ▄▄  ▄▄ ▄▄ ▄▄  ▄▄  ▄▄▄▄ 
            ██ ███▄▄   ██▄█▄ ██ ██ ███▄██ ███▄██ ██ ███▄██ ██ ▄▄ 
            ██ ▄▄██▀   ██ ██ ▀███▀ ██ ▀██ ██ ▀██ ██ ██ ▀██ ▀███▀                                                                                                                                                                                                                                                                                                                                                                                                                                
"""

logging.basicConfig(
    level=logging.INFO,
    format="%(asctime)s [%(levelname)s] %(message)s",
    handlers=[logging.StreamHandler()],
    force=True
)

logger = logging.getLogger(__name__)


@asynccontextmanager
async def lifespan(app: FastAPI):
    logger.info(ASCII_ART)
    yield


app = FastAPI(title="SamvadSQL", lifespan=lifespan)


@app.get("/")
def root():
    return {"message": "SamvadSQL is up and reunning on PPORT: 8000", "gemini_key_set": bool(settings.gemini_api_key)}
